# digit 数字，整数
'''
进制：
1. DEC 十进制 Decimal
2. BIN 二进制 Binary 
3. OCT 八进制 Octal
4. HEX 十六进制 Hexadecimal
'''
'''
a = 100
b = 0b11010110  # 0B  二进制
c = 0o1132      # 0O  八进制
d = 0xcd8       # 0X  十六进制
# 字符串 == 很多的字符加在一块
e = '计算机'     # encoding 编码
f = bytes(e, encoding='utf-8') # byte str :: str
print(a, b, c, d, e)
'''


'''
0000 0000 一个字节 Byte == 8 Bits 比特
0000 0001 (DEC) 1
0000 0010 (DEC) 2
0000 0011 3
0000 0100 4

1101 0110 
|| |  ||
7654 3210
2**0 1
2**1 2
2**2 4
2**4 16
2**6 64
2**7 128


  102 / 2
   51 / 2
   25 / 2
   12 / 2
    6 / 2
    3 / 2
    1 / 2
0 1 1 0 0 1 1

0110 0110
 ||   ||
7654 3210
2 + 4 + 32 + 64 = 102
'''

print(round(0.1 + 0.2,6))
